app/controllers/bumps_controller.rb

SELECT "bumps".* FROM "bumps"
---
  def index
    user_id = current_user.id
    @bumps = Bump.all

INSERT INTO "bumps" ("latitude", "longitude", "lengthSteps", "widthSteps", "depth", "videoUrl", "price", "costales", "completed", "kg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @bump = current_user.bumps.new(bump_params)
    ##@bump = Bump.new(bump_params)

    respond_to do |format|
      if @bump.save

UPDATE "bumps" SET "latitude" = ?, "longitude" = ?, "lengthSteps" = ?, "widthSteps" = ?, "depth" = ?, "videoUrl" = ?, "price" = ?, "completed" = ?, "kg" = ?, "updated_at" = ? WHERE "bumps"."id" = ?
---
  def update
    respond_to do |format|
      if @bump.update(bump_params)

SELECT  "bumps".* FROM "bumps" WHERE "bumps"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_bump
      @bump = Bump.find(params[:id])