app/controllers/donatives_controller.rb

  def create

    @donative = current_user.donatives.new(donative_params)
    @donative.email = current_user.email
    @donative.bump=@bump
    ##@donative = Donative.new(donative_params)
    respond_to do |format|
      if @donative.save
---
INSERT INTO "donatives" ("money", "comment", "user_id", "bump_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["money", 57], ["comment", "Ese bache esta re feo 2"], ["user_id", 1], ["bump_id", 1], ["created_at", "2016-11-29 09:29:34.058032"], ["updated_at", "2016-11-29 09:29:34.058032"]]

    def set_bump
      @bump=Bump.find(params[:bump_id])
---
SELECT  "bumps".* FROM "bumps" WHERE "bumps"."id" = ? LIMIT 1  [["id", 1]]

    def set_donative
      @donative = Donative.find(params[:id])
---
SELECT  "donatives".* FROM "donatives" WHERE "donatives"."id" = ? LIMIT 1  [["id", 1]]